AhmedAtia1507/Spectrophotometer_GP/STM32_CHECKPOINT/Final_3/Src/APP/SCommands/SCommands_Program.c
/**
 * @file SCommands_Program.c
 * @author Ahmed Atia Said (atiaa6501@gmail.com)
 * @brief 
 * @version 1.0
 * @date 2024-02-19
 * 
 * @copyright Copyright (c) 2024
 * 
 */
#include <string.h>
#include <stdlib.h>

#include "../../LIB/STD_TYPES/Std_Types.h"

#include "../../MCAL/GPIO/GPIO_Interface.h"
#include "../../MCAL/RTC/RTC_Interface.h"
#include "../../MCAL/UART/UART_Interface.h"
#include "../../MCAL/STK/STK_Interface.h"
#include "../../MCAL/NVIC/NVIC_Interface.h"
#include "../../MCAL/SCB/SCB_Interface.h"
#include "../../MCAL/RCC/RCC_Interface.h"
#include "../../MCAL/GPTMR/GPTMR_Interface.h"

#include "../../HAL/ESP32/ESP32_Interface.h"
#include "../../HAL/SPWRVolt/SPWRVolt_Interface.h"
#include "../../HAL/STEPPER_MOTOR/MOTORS_Interface.h"
#include "../../HAL/EEPROM/I2C_Slave_EEPROM.h"
#include "../../HAL/PWRSupply/HPWRSupply_Interface.h"
#include "../../HAL/MCP4151/MCP4151.h"

#include "../SpectroStatus/SpectroStatus_Interface.h"
#include "../Signal_Conditioning/signal_conditioning.h"

#include "SCommands_Config.h"
#include "SCommands_Interface.h"
#include "SCommands_Private.h"


Std_ReturnType SCommands_Init(void)
{
	HESP32_SetCommandCallbackFunction       (0, SCommands_GetUVStatus);
	HESP32_SetCommandCallbackFunction       (1, SCommands_SetUVOn);
	HESP32_SetCommandCallbackFunction       (2, SCommands_SetUVOff);
	HESP32_SetCommandCallbackFunction       (3, SCommands_GetVisStatus);
	HESP32_SetCommandCallbackFunction       (4, SCommands_SetVisOn);
	HESP32_SetCommandCallbackFunction       (5, SCommands_SetVisOff);
	HESP32_SetCommandCallbackFunction       (6, SCommands_GetSupplyVoltages);

	HESP32_SetCommandCallbackFunction       (7, SCommands_SendCurrentMotorsSteps);
	HESP32_SetCommandCallbackFunction       (8, SCommands_HomeLampMotor);
	HESP32_SetCommandCallbackFunction       (9, SCommands_HomeWLSelectMotor);
	HESP32_SetCommandCallbackFunction       (10, SCommands_HomeFilterSelectMotor);
	HESP32_SetCommandCallbackFunction       (11, SCommands_SendCurrentWL);
	HESP32_SetCommandCallbackFunction       (12, SCommands_SendCurrentDateTime);
	HESP32_SetCommandCallbackFunction       (13, SCommands_SendCurrentDetectorValues);
	HESP32_SetCommandCallbackFunction       (14, SCommands_GetLampMotorPosition);
	HESP32_SetCommandCallbackFunction       (15, SCommands_SetLampMotorVisible);
	HESP32_SetCommandCallbackFunction       (16, SCommands_SetLampMotorUV);

	HESP32_SetCommandCallbackArgFunction    (17, SCommands_UpdateDateTime);
	HESP32_SetCommandCallbackArgFunction    (18, SCommands_SaveFilterMotorCalibSteps);
	HESP32_SetCommandCallbackArgFunction    (19, SCommands_SaveFilterMotorCalibWL);
	HESP32_SetCommandCallbackArgFunction    (20, SCommands_StartOperation);
	HESP32_SetCommandCallbackArgFunction    (21, SCommands_SetReferenceGain);
	HESP32_SetCommandCallbackArgFunction    (22, SCommands_SetSampleGain);
	HESP32_SetCommandCallbackArgFunction    (23, SCommands_MoveFilterLeft);
	HESP32_SetCommandCallbackArgFunction    (24, SCommands_MoveFilterRight);
	HESP32_SetCommandCallbackArgFunction    (25, SCommands_SelectFilter);
	HESP32_SetCommandCallbackArgFunction    (26, SCommands_SelectGratingWL);
	HESP32_SetCommandCallbackArgFunction    (27, SCommands_MoveGratingLeft);
	HESP32_SetCommandCallbackArgFunction    (28, SCommands_MoveGratingRight);

	HESP32_InitInterface();

	return E_OK;
}

void SCommands_GetUVStatus(void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint8 Loc_uint8LampStatus = MGPIO_LOW;
	MGPIO_GetPinValue(SPECTRO_UV_POWER_CONTROL_PORT_ID, SPECTRO_UV_POWER_CONTROL_PIN_ID, &Loc_uint8LampStatus);
	if(Loc_uint8LampStatus == MGPIO_LOW)
	{
		HESP32_SendCommand("on");
	}
	else if(Loc_uint8LampStatus == MGPIO_HIGH)
	{
		HESP32_SendCommand("off");
	}
	else
	{
		/*Do nothing*/
	}
	//HPWRSupply_Status_t Loc_uint32SupplyStatus = HPWRSUPPLY_STATUS_OFF;
	//HPWRSupply_CheckSupplyStatus(HPWRSUPPLY_UV_SUPPLY, &Loc_uint32SupplyStatus);
	//if(Loc_uint32SupplyStatus == HPWRSUPPLY_STATUS_OK)
	//{
	//    HESP32_SendCommand("on");
	//}
	//else
	//{
	//    HESP32_SendCommand("off");
	//}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SetUVOn(void)
{
//	SpectroStatus_SetNewStatus(BUSY);
//	MGPIO_SetPinValue(SPECTRO_UV_POWER_CONTROL_PORT_ID, SPECTRO_UV_POWER_CONTROL_PIN_ID, MGPIO_HIGH);
//	HESP32_SendCommand("on");
	Std_ReturnType Loc_uint8UVStatus = HPWRSupply_SetSupplyMode(HPWRSUPPLY_UV_SUPPLY, HPWRSUPPLY_ON);
	if(Loc_uint8UVStatus == E_OK)
	{
	    HESP32_SendCommand("on");
	}
	else
	{
	    HESP32_SendCommand("off");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SetUVOff(void)
{
//	SpectroStatus_SetNewStatus(BUSY);
//	MGPIO_SetPinValue(SPECTRO_UV_POWER_CONTROL_PORT_ID, SPECTRO_UV_POWER_CONTROL_PIN_ID, MGPIO_LOW);
//	HESP32_SendCommand("off");
	Std_ReturnType Loc_uint8UVStatus = HPWRSupply_SetSupplyMode(HPWRSUPPLY_UV_SUPPLY, HPWRSUPPLY_OFF);
	if(Loc_uint8UVStatus == E_OK)
	{
	    HESP32_SendCommand("off");
	}
	else
	{
	    HESP32_SendCommand("on");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_GetVisStatus(void)
{
//	SpectroStatus_SetNewStatus(BUSY);
//	uint8 Loc_uint8LampStatus = MGPIO_LOW;
//	MGPIO_GetPinValue(SPECTRO_VIS_POWER_CONTROL_PORT_ID, SPECTRO_VIS_POWER_CONTROL_PIN_ID, &Loc_uint8LampStatus);
//	if(Loc_uint8LampStatus == MGPIO_HIGH)
//	{
//		HESP32_SendCommand("on");
//	}
//	else if(Loc_uint8LampStatus == MGPIO_LOW)
//	{
//		HESP32_SendCommand("off");
//	}
//	else
//	{
//		/*Do nothing*/
//	}
	HPWRSupply_Status_t Loc_uint32SupplyStatus = HPWRSUPPLY_STATUS_OFF;
	HPWRSupply_CheckSupplyStatus(HPWRSUPPLY_VIS_SUPPLY, &Loc_uint32SupplyStatus);
	if(Loc_uint32SupplyStatus == HPWRSUPPLY_STATUS_OK)
	{
	    HESP32_SendCommand("on");
	}
	else
	{
	    HESP32_SendCommand("off");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SetVisOn(void)
{
//	SpectroStatus_SetNewStatus(BUSY);
//	MGPIO_SetPinValue(SPECTRO_VIS_POWER_CONTROL_PORT_ID, SPECTRO_VIS_POWER_CONTROL_PIN_ID, MGPIO_HIGH);
//	HESP32_SendCommand("on");
	Std_ReturnType Loc_uint8UVStatus = HPWRSupply_SetSupplyMode(HPWRSUPPLY_VIS_SUPPLY, HPWRSUPPLY_ON);
	if(Loc_uint8UVStatus == E_OK)
	{
	    HESP32_SendCommand("on");
	}
	else
	{
	    HESP32_SendCommand("off");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SetVisOff(void)
{
//	SpectroStatus_SetNewStatus(BUSY);
//	MGPIO_SetPinValue(SPECTRO_VIS_POWER_CONTROL_PORT_ID, SPECTRO_VIS_POWER_CONTROL_PIN_ID, MGPIO_LOW);
//	HESP32_SendCommand("off");
	Std_ReturnType Loc_uint8UVStatus = HPWRSupply_SetSupplyMode(HPWRSUPPLY_VIS_SUPPLY, HPWRSUPPLY_OFF);
	if(Loc_uint8UVStatus == E_OK)
	{
	    HESP32_SendCommand("off");
	}
	else
	{
	    HESP32_SendCommand("on");
	}
	SpectroStatus_SetNewStatus(IDLE);
}

void SCommands_GetSupplyVoltages(void)
{
	SpectroStatus_SetNewStatus(BUSY);
	uint16 Loc_uint16VoltageConversion = 0;
	float32 Loc_float32VoltageValue = 0.0;
	uint8 glbl_uint8VoltageBuffer[5][32] = {{0}};
	uint16 Loc_uint16EnteredVoltageConversion = 0;
	uint16 Loc_uint16_33VoltageConversion = 0;
	float32 Loc_float32EnteredVoltageValue = 0.0;
	float32 Loc_float32_33VoltageValue = 0.0;

	/*************************************************P12*****************************************************/
	SPWRVolt_GetVoltage(SPWRVOLT_DCDC_POS_12, &Loc_uint16VoltageConversion);

	Loc_float32VoltageValue = (float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) * 4;

	float_to_string_manual((glbl_uint8VoltageBuffer[0] + 1),Loc_float32VoltageValue, 3);
	glbl_uint8VoltageBuffer[0][0] = '+';

	/************************************************N12*****************************************************/
	SPWRVolt_GetVoltage(SPWRVOLT_DCDC_NEG_12, &Loc_uint16EnteredVoltageConversion);
	SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_33, &Loc_uint16_33VoltageConversion);

	Loc_float32EnteredVoltageValue = (float32)((float32)((float32)Loc_uint16EnteredVoltageConversion / 4096) * 3.3f) ;
	Loc_float32_33VoltageValue = (float32)((float32)((float32)Loc_uint16_33VoltageConversion / 4096) * 3.3f) * 2 ;

	Loc_float32VoltageValue = ((Loc_float32_33VoltageValue - Loc_float32EnteredVoltageValue) * 11) - 3.3f;

	//snprintf((glbl_uint8VoltageBuffer + 1), (sizeof(glbl_uint8VoltageBuffer) - 1), "%.*f", 3,Loc_float32FinalVoltageValue);
	float_to_string_manual((glbl_uint8VoltageBuffer[1] + 1),Loc_float32VoltageValue, 3);
	glbl_uint8VoltageBuffer[1][0] = '-';

	/************************************************P5*****************************************************/
	SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_5, &Loc_uint16VoltageConversion);

	Loc_float32VoltageValue = ((float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f)) * 2;

	//snprintf(glbl_uint8VoltageBuffer, sizeof(glbl_uint8VoltageBuffer), "%.*f", 3,Loc_float32VoltageValue);
	float_to_string_manual((glbl_uint8VoltageBuffer[2]),Loc_float32VoltageValue, 3);

	/***********************************************P3.3****************************************************/
	SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_33, &Loc_uint16VoltageConversion);

	Loc_float32VoltageValue = (float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) * 2;

	//snprintf(glbl_uint8VoltageBuffer, sizeof(glbl_uint8VoltageBuffer), "%.*f", 3,Loc_float32VoltageValue);
	float_to_string_manual((glbl_uint8VoltageBuffer[3]),Loc_float32VoltageValue, 3);

	/***********************************************Supply 12***********************************************/
	SPWRVolt_GetVoltage(SPWRVOLT_SUPPLY_12, &Loc_uint16VoltageConversion);

	Loc_float32VoltageValue = (float32)((float32)((float32)Loc_uint16VoltageConversion / 4096) * 3.3f) * 4;

	//snprintf(glbl_uint8VoltageBuffer, sizeof(glbl_uint8VoltageBuffer), "%.*f", 3,Loc_float32VoltageValue);
	float_to_string_manual((glbl_uint8VoltageBuffer[4]),Loc_float32VoltageValue, 3);

