AhmedAtia1507/Spectrophotometer_GP/STM32_CHECKPOINT/Final_3/Src/APP/SCommands/SCommands_Program.c
void SCommands_MoveFilterSelectMotor         (uint8* P_uint8MotorSteps)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8MotorSteps != NULL_PTR)
	{
		uint32 Loc_uint32FilterCurrentSteps = 0;
		HMOTOR_GetCurrentMotorSteps(HMOTOR_FILTER_SELECT, &Loc_uint32FilterCurrentSteps);

		uint32 Loc_uint32MotorSteps = atoi(P_uint8MotorSteps);
		uint32 Loc_uint32MotorDiff = 0;
		if(Loc_uint32MotorSteps > Loc_uint32FilterCurrentSteps)
		{
			Loc_uint32MotorDiff = Loc_uint32MotorSteps - Loc_uint32FilterCurrentSteps;
			HMOTOR_Step(HMOTOR_FILTER_SELECT, Loc_uint32MotorDiff, HMOTORS_CLKWISE_DIRECTION, 4);
		}
		else if(Loc_uint32MotorSteps < Loc_uint32FilterCurrentSteps)
		{
			Loc_uint32MotorDiff = Loc_uint32FilterCurrentSteps - Loc_uint32MotorSteps;
			HMOTOR_Step(HMOTOR_FILTER_SELECT, Loc_uint32MotorDiff, HMOTORS_CCLKWISE_DIRECTION, 4);
		}
		else
		{
			/*Do nothing*/
		}
		HESP32_SendCommand("moved");
	}
	else
	{
		HESP32_SendCommand("failed to move");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SaveFilterMotorCalibSteps          (uint8* P_uint8MotorSteps)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8MotorSteps != NULL_PTR)
	{
		uint32 Loc_uint32FilterSteps = atoi(P_uint8MotorSteps);
		eeprom_write_Nbytes(EEPROM_MOTOR_STEPS_MEM_ADDRESS, &Loc_uint32FilterSteps, 4);
		HESP32_SendCommand("saved");
	}
	else
	{
		HESP32_SendCommand("failed to save");
	}
	SpectroStatus_SetNewStatus(IDLE);
}


void SCommands_SaveFilterMotorCalibWL          (uint8* P_uint8Wavelength)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8Wavelength != NULL_PTR)
	{
		uint32 Loc_uint32FilterWL = atoi(P_uint8Wavelength);
		eeprom_write_Nbytes(EEPROM_MOTOR_WL_MEM_ADDRESS, &Loc_uint32FilterWL, 4);
		HESP32_SendCommand("saved");
	}
	else
	{
		HESP32_SendCommand("failed to save");
	}
	SpectroStatus_SetNewStatus(IDLE);
}

static volatile uint32 glbl_uint32randomSeed = 1234;
// Function to seed the random number generator
void seed_random() {
	srand(glbl_uint32randomSeed);
}
// Function to generate random float between min and max
float32 random_float(float32 min, float32 max) {
	float32 scale_factor = 1.0f / RAND_MAX;
	uint32 random_int = rand();
	float32 random_float = random_int * scale_factor;
	random_float = (max - min) * random_float + min;
	return random_float;
}

// Function to generate random I_reference and I_sample
void generate_random_values(float32 *I_reference, float32 *I_sample) {
	seed_random();
	glbl_uint32randomSeed++;
	*I_reference = random_float(0.0f, 12.0f);
	*I_sample = random_float(0.0f, 12.0f);

	// Ensure I_reference is greater than or equal to I_sample
	if (*I_reference < *I_sample) {
		// Swap values if necessary
		float32 temp = *I_reference;
		*I_reference = *I_sample;
		*I_sample = temp;
	}
}
float32 gain_ref;
float32 gain_sample;

float32 round_float(float32 number)
{
	if((number - (uint32)(number)) >= 0.5)
	{
		return ((uint32)(number) + 1.0f);
	}
	else
	{
		return ((uint32)(number));
	}
}

static volatile uint32 glbl_uint32NoOfRead = 0;
static volatile float32 glbl_float32StepsPerReading = 0.0;
//Loc_float32ScanParameters[0] --> start wavelength
//Loc_float32ScanParameters[1] --> end wavelength
//Loc_float32ScanParameters[2] --> wavelength resolution
static volatile float32 Loc_float32ScanParameters[3] = {0.0};

void SCommands_ScanOperation			(void)
{
	static uint32 glbl_uint32FunctionCounter = 0;
	static uint32 skipped = 0;
	static float32 current_steps = 0.0;
	static uint32 flag_UV = 0;
	static uint8 flag_skip = 0;
	static uint32 entry_count = 0;

	if(entry_count == 0)
	{
		entry_count = (uint32)glbl_float32StepsPerReading;
	}
	HMOTOR_StepNoDelay(HMOTOR_WL_SELECT, HMOTORS_CCLKWISE_DIRECTION);

	if(entry_count == 1)
	{
		entry_count = (uint32)glbl_float32StepsPerReading;
		current_steps += glbl_float32StepsPerReading;
	//	if((current_steps - (uint32)(current_steps)) >= 0.5f)
	//	{
	//		current_steps -= 0.5f;
	//		current_steps ++;
	//		skipped++;
	//	}
		if((((uint32)(current_steps * 10) % 10) == 0))
		{
			flag_skip = 0;
		}
		if((((uint32)(current_steps * 10) % 5) == 0) && (((uint32)(current_steps * 10) % 10) != 0) && (flag_skip == 0))
		{
			flag_skip = 1;
			entry_count = 1;
			skipped++;
		}
		else
		{
			glbl_uint32FunctionCounter++;
			float32 de7k1 = 0.0;
			float32 de7k2 = 0.0;
			read_reference_voltage(&de7k1, &gain_ref);
			read_sample_voltage(&de7k2, &gain_sample);
			MUART_SendIntegerValue(UART3, glbl_uint32FunctionCounter);
			MUART_TxChar(UART3, ':');
			MUART_TxChar(UART3, ' ');
			HESP32_SendIntensities(de7k1, de7k2);
			Loc_float32ScanParameters[1] -= Loc_float32ScanParameters[2];
			if((Loc_float32ScanParameters[1] < 326.0f) && (flag_UV == 0))
			{
				MGPTMR_StopTimer(MGPTMR2);
				HMOTOR_MoveLampMotor(HMOTOR_LAMP_UV);
				flag_UV = 1;
				MGPTMR_StartTimer(MGPTMR2);
			}
			if(glbl_uint32FunctionCounter == glbl_uint32NoOfRead)
			{
				MGPTMR_StopTimer(MGPTMR2);
				HPWRSupply_SetSupplyMode(HPWRSUPPLY_UV_SUPPLY, HPWRSUPPLY_OFF);
				HPWRSupply_SetSupplyMode(HPWRSUPPLY_VIS_SUPPLY, HPWRSUPPLY_OFF);
				uint32 steps = 0;
				HMOTOR_GetCurrentMotorSteps(HMOTOR_WL_SELECT, &steps);
				MUART_TxString(UART3, "WL Current Steps = ");
				MUART_SendIntegerValue(UART3, steps);
				MUART_TxChar(UART3, '\n');
				MUART_TxString(UART3, "Skipped = ");
				MUART_SendIntegerValue(UART3, skipped);
				MUART_TxChar(UART3, '\n');

			}
		}

	}
	else
	{
		entry_count--;
	}
}
void SCommands_StartOperation         	(uint8* P_uint8ScanParam)
{
	SpectroStatus_SetNewStatus(BUSY);
	if(P_uint8ScanParam != NULL_PTR)
	{
		uint8* P_uint8Token = NULL_PTR;
		uint8 Loc_uint8Index = 0;
		float32 Loc_float32RefIntensity = 0.0;
		float32 Loc_float32SampleIntensity = 0.0;

		// separate the string input P_uint8ScanParam to three strings
		P_uint8Token = strtok(P_uint8ScanParam, " ");
		Loc_float32ScanParameters[Loc_uint8Index] = atof(P_uint8Token);
		Loc_uint8Index++;

		while((P_uint8Token != NULL_PTR) && (Loc_uint8Index < 3))
		{
			P_uint8Token = strtok(NULL_PTR, " ");
			Loc_float32ScanParameters[Loc_uint8Index++] = atof(P_uint8Token);
		}

